Reports/ОтработанноеВремя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>ОтработанноеВремя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтборПоОтделу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

CalculationRegisters/ЗаработнаяПлата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<CalculationRegister>
		<Properties>
			<Name>ЗаработнаяПлата</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикРаботыПредприятия.Resource.День</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикРаботыПредприятия.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.НачисленияСотрудникам</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Премиальные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Reports/ОтработанноеВремя/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель КАК СотрудникРодитель
	|ИЗ
	|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серсия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серсия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(Отбор)
	
	ДиаграммаГанта.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель КАК СотрудникРодитель
	|ИЗ
	|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ЗаработнаяПлатаФактическийПериодДействия.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель",Отбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серсия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серсия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Отбор = Отчет.ОтборПоОтделу;
	
	Если НЕ ЗначениеЗаполнено(Отбор) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаСервере(Отбор);
КонецПроцедуры
